RT-Thread/rt-thread/bsp/lm3s/Libraries/inc/hw_usb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE7 register.
//
//*****************************************************************************
#define USB_RXTYPE7_SPEED_M     0x000000C0  // Operating Speed.
#define USB_RXTYPE7_SPEED_DFLT  0x00000000  // Default
#define USB_RXTYPE7_SPEED_FULL  0x00000080  // Full
#define USB_RXTYPE7_SPEED_LOW   0x000000C0  // Low
#define USB_RXTYPE7_PROTO_M     0x00000030  // Protocol.
#define USB_RXTYPE7_PROTO_CTRL  0x00000000  // Control
#define USB_RXTYPE7_PROTO_ISOC  0x00000010  // Isochronous
#define USB_RXTYPE7_PROTO_BULK  0x00000020  // Bulk
#define USB_RXTYPE7_PROTO_INT   0x00000030  // Interrupt
#define USB_RXTYPE7_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_RXTYPE7_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL7
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL7_TXPOLL_M \
                                0x000000FF  // RX Polling
#define USB_RXINTERVAL7_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_RXINTERVAL7_NAKLMT_S \
                                0
#define USB_RXINTERVAL7_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP8 register.
//
//*****************************************************************************
#define USB_TXMAXP8_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_TXMAXP8_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL8 register.
//
//*****************************************************************************
#define USB_TXCSRL8_INCTX       0x00000080  // Incomplete Transmit.
#define USB_TXCSRL8_NAKTO       0x00000080  // NAK Timeout
#define USB_TXCSRL8_CLRDT       0x00000040  // Clear Data Toggle.
#define USB_TXCSRL8_STALLED     0x00000020  // Endpoint Stalled.
#define USB_TXCSRL8_STALL       0x00000010  // Send Stall.
#define USB_TXCSRL8_SETUP       0x00000010  // Setup Packet.
#define USB_TXCSRL8_FLUSH       0x00000008  // Flush FIFO.
#define USB_TXCSRL8_ERROR       0x00000004  // Error.
#define USB_TXCSRL8_UNDRN       0x00000004  // Underrun.
#define USB_TXCSRL8_FIFONE      0x00000002  // FIFO Not Empty.
#define USB_TXCSRL8_TXRDY       0x00000001  // Transmit Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH8 register.
//
//*****************************************************************************
#define USB_TXCSRH8_AUTOSET     0x00000080  // Auto Set.
#define USB_TXCSRH8_ISO         0x00000040  // ISO.
#define USB_TXCSRH8_MODE        0x00000020  // Mode.
#define USB_TXCSRH8_DMAEN       0x00000010  // DMA Request Enable.
#define USB_TXCSRH8_FDT         0x00000008  // Force Data Toggle.
#define USB_TXCSRH8_DMAMOD      0x00000004  // DMA Request Mode.
#define USB_TXCSRH8_DTWE        0x00000002  // Data Toggle Write Enable.
#define USB_TXCSRH8_DT          0x00000001  // Data Toggle.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP8 register.
//
//*****************************************************************************
#define USB_RXMAXP8_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_RXMAXP8_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL8 register.
//
//*****************************************************************************
#define USB_RXCSRL8_CLRDT       0x00000080  // Clear Data Toggle.
#define USB_RXCSRL8_STALLED     0x00000040  // Endpoint Stalled.
#define USB_RXCSRL8_STALL       0x00000020  // Send Stall.
#define USB_RXCSRL8_REQPKT      0x00000020  // Request Packet.
#define USB_RXCSRL8_FLUSH       0x00000010  // Flush FIFO.
#define USB_RXCSRL8_NAKTO       0x00000008  // NAK Timeout.
#define USB_RXCSRL8_DATAERR     0x00000008  // Data Error.
#define USB_RXCSRL8_OVER        0x00000004  // Overrun.
#define USB_RXCSRL8_ERROR       0x00000004  // Error.
#define USB_RXCSRL8_FULL        0x00000002  // FIFO Full.
#define USB_RXCSRL8_RXRDY       0x00000001  // Receive Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH8 register.
//
//*****************************************************************************
#define USB_RXCSRH8_AUTOCL      0x00000080  // Auto Clear.
#define USB_RXCSRH8_AUTORQ      0x00000040  // Auto Request.
#define USB_RXCSRH8_ISO         0x00000040  // ISO.
#define USB_RXCSRH8_DMAEN       0x00000020  // DMA Request Enable.
#define USB_RXCSRH8_DISNYET     0x00000010  // Disable NYET
#define USB_RXCSRH8_PIDERR      0x00000010  // PID Error.
#define USB_RXCSRH8_DMAMOD      0x00000008  // DMA Request Mode.
#define USB_RXCSRH8_DTWE        0x00000004  // Data Toggle Write Enable.
#define USB_RXCSRH8_DT          0x00000002  // Data Toggle.
#define USB_RXCSRH8_INCRX       0x00000001  // Incomplete Receive.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT8 register.
//
//*****************************************************************************
#define USB_RXCOUNT8_COUNT_M    0x00001FFF  // Receive Packet Count.
#define USB_RXCOUNT8_COUNT_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE8 register.
//
//*****************************************************************************
#define USB_TXTYPE8_SPEED_M     0x000000C0  // Operating Speed.
#define USB_TXTYPE8_SPEED_DFLT  0x00000000  // Default
#define USB_TXTYPE8_SPEED_FULL  0x00000080  // Full
#define USB_TXTYPE8_SPEED_LOW   0x000000C0  // Low
#define USB_TXTYPE8_PROTO_M     0x00000030  // Protocol.
#define USB_TXTYPE8_PROTO_CTRL  0x00000000  // Control
#define USB_TXTYPE8_PROTO_ISOC  0x00000010  // Isochronous
#define USB_TXTYPE8_PROTO_BULK  0x00000020  // Bulk
#define USB_TXTYPE8_PROTO_INT   0x00000030  // Interrupt
#define USB_TXTYPE8_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_TXTYPE8_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL8
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL8_TXPOLL_M \
                                0x000000FF  // TX Polling
#define USB_TXINTERVAL8_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_TXINTERVAL8_NAKLMT_S \
                                0
#define USB_TXINTERVAL8_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE8 register.
//
//*****************************************************************************
#define USB_RXTYPE8_SPEED_M     0x000000C0  // Operating Speed.
#define USB_RXTYPE8_SPEED_DFLT  0x00000000  // Default
#define USB_RXTYPE8_SPEED_FULL  0x00000080  // Full
#define USB_RXTYPE8_SPEED_LOW   0x000000C0  // Low
#define USB_RXTYPE8_PROTO_M     0x00000030  // Protocol.
#define USB_RXTYPE8_PROTO_CTRL  0x00000000  // Control
#define USB_RXTYPE8_PROTO_ISOC  0x00000010  // Isochronous
#define USB_RXTYPE8_PROTO_BULK  0x00000020  // Bulk
#define USB_RXTYPE8_PROTO_INT   0x00000030  // Interrupt
#define USB_RXTYPE8_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_RXTYPE8_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL8
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL8_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_RXINTERVAL8_TXPOLL_M \
                                0x000000FF  // RX Polling
#define USB_RXINTERVAL8_NAKLMT_S \
                                0
#define USB_RXINTERVAL8_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP9 register.
//
//*****************************************************************************
#define USB_TXMAXP9_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_TXMAXP9_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL9 register.
//
//*****************************************************************************
#define USB_TXCSRL9_INCTX       0x00000080  // Incomplete Transmit.
#define USB_TXCSRL9_NAKTO       0x00000080  // NAK Timeout
#define USB_TXCSRL9_CLRDT       0x00000040  // Clear Data Toggle.
#define USB_TXCSRL9_STALLED     0x00000020  // Endpoint Stalled.
#define USB_TXCSRL9_SETUP       0x00000010  // Setup Packet.
#define USB_TXCSRL9_STALL       0x00000010  // Send Stall.
#define USB_TXCSRL9_FLUSH       0x00000008  // Flush FIFO.
#define USB_TXCSRL9_ERROR       0x00000004  // Error.
#define USB_TXCSRL9_UNDRN       0x00000004  // Underrun.
#define USB_TXCSRL9_FIFONE      0x00000002  // FIFO Not Empty.
#define USB_TXCSRL9_TXRDY       0x00000001  // Transmit Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH9 register.
//
//*****************************************************************************
#define USB_TXCSRH9_AUTOSET     0x00000080  // Auto Set.
#define USB_TXCSRH9_ISO         0x00000040  // ISO.
#define USB_TXCSRH9_MODE        0x00000020  // Mode.
#define USB_TXCSRH9_DMAEN       0x00000010  // DMA Request Enable.
#define USB_TXCSRH9_FDT         0x00000008  // Force Data Toggle.
#define USB_TXCSRH9_DMAMOD      0x00000004  // DMA Request Mode.
#define USB_TXCSRH9_DTWE        0x00000002  // Data Toggle Write Enable.
#define USB_TXCSRH9_DT          0x00000001  // Data Toggle.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP9 register.
//
//*****************************************************************************
#define USB_RXMAXP9_MAXLOAD_M   0x000007FF  // Maximum Payload.
#define USB_RXMAXP9_MAXLOAD_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL9 register.
//
//*****************************************************************************
#define USB_RXCSRL9_CLRDT       0x00000080  // Clear Data Toggle.
#define USB_RXCSRL9_STALLED     0x00000040  // Endpoint Stalled.
#define USB_RXCSRL9_STALL       0x00000020  // Send Stall.
#define USB_RXCSRL9_REQPKT      0x00000020  // Request Packet.
#define USB_RXCSRL9_FLUSH       0x00000010  // Flush FIFO.
#define USB_RXCSRL9_DATAERR     0x00000008  // Data Error.
#define USB_RXCSRL9_NAKTO       0x00000008  // NAK Timeout.
#define USB_RXCSRL9_ERROR       0x00000004  // Error.
#define USB_RXCSRL9_OVER        0x00000004  // Overrun.
#define USB_RXCSRL9_FULL        0x00000002  // FIFO Full.
#define USB_RXCSRL9_RXRDY       0x00000001  // Receive Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH9 register.
//
//*****************************************************************************
#define USB_RXCSRH9_AUTOCL      0x00000080  // Auto Clear.
#define USB_RXCSRH9_ISO         0x00000040  // ISO.
#define USB_RXCSRH9_AUTORQ      0x00000040  // Auto Request.
#define USB_RXCSRH9_DMAEN       0x00000020  // DMA Request Enable.
#define USB_RXCSRH9_PIDERR      0x00000010  // PID Error.
#define USB_RXCSRH9_DISNYET     0x00000010  // Disable NYET
#define USB_RXCSRH9_DMAMOD      0x00000008  // DMA Request Mode.
#define USB_RXCSRH9_DTWE        0x00000004  // Data Toggle Write Enable.
#define USB_RXCSRH9_DT          0x00000002  // Data Toggle.
#define USB_RXCSRH9_INCRX       0x00000001  // Incomplete Receive.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT9 register.
//
//*****************************************************************************
#define USB_RXCOUNT9_COUNT_M    0x00001FFF  // Receive Packet Count.
#define USB_RXCOUNT9_COUNT_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE9 register.
//
//*****************************************************************************
#define USB_TXTYPE9_SPEED_M     0x000000C0  // Operating Speed.
#define USB_TXTYPE9_SPEED_DFLT  0x00000000  // Default
#define USB_TXTYPE9_SPEED_FULL  0x00000080  // Full
#define USB_TXTYPE9_SPEED_LOW   0x000000C0  // Low
#define USB_TXTYPE9_PROTO_M     0x00000030  // Protocol.
#define USB_TXTYPE9_PROTO_CTRL  0x00000000  // Control
#define USB_TXTYPE9_PROTO_ISOC  0x00000010  // Isochronous
#define USB_TXTYPE9_PROTO_BULK  0x00000020  // Bulk
#define USB_TXTYPE9_PROTO_INT   0x00000030  // Interrupt
#define USB_TXTYPE9_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_TXTYPE9_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL9
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL9_TXPOLL_M \
                                0x000000FF  // TX Polling
#define USB_TXINTERVAL9_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_TXINTERVAL9_TXPOLL_S \
                                0
#define USB_TXINTERVAL9_NAKLMT_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE9 register.
//
//*****************************************************************************
#define USB_RXTYPE9_SPEED_M     0x000000C0  // Operating Speed.
#define USB_RXTYPE9_SPEED_DFLT  0x00000000  // Default
#define USB_RXTYPE9_SPEED_FULL  0x00000080  // Full
#define USB_RXTYPE9_SPEED_LOW   0x000000C0  // Low
#define USB_RXTYPE9_PROTO_M     0x00000030  // Protocol.
#define USB_RXTYPE9_PROTO_CTRL  0x00000000  // Control
#define USB_RXTYPE9_PROTO_ISOC  0x00000010  // Isochronous
#define USB_RXTYPE9_PROTO_BULK  0x00000020  // Bulk
#define USB_RXTYPE9_PROTO_INT   0x00000030  // Interrupt
#define USB_RXTYPE9_TEP_M       0x0000000F  // Target Endpoint Number.
#define USB_RXTYPE9_TEP_S       0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL9
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL9_TXPOLL_M \
                                0x000000FF  // RX Polling
#define USB_RXINTERVAL9_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_RXINTERVAL9_NAKLMT_S \
                                0
#define USB_RXINTERVAL9_TXPOLL_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXMAXP10 register.
//
//*****************************************************************************
#define USB_TXMAXP10_MAXLOAD_M  0x000007FF  // Maximum Payload.
#define USB_TXMAXP10_MAXLOAD_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRL10 register.
//
//*****************************************************************************
#define USB_TXCSRL10_NAKTO      0x00000080  // NAK Timeout
#define USB_TXCSRL10_INCTX      0x00000080  // Incomplete Transmit.
#define USB_TXCSRL10_CLRDT      0x00000040  // Clear Data Toggle.
#define USB_TXCSRL10_STALLED    0x00000020  // Endpoint Stalled.
#define USB_TXCSRL10_SETUP      0x00000010  // Setup Packet.
#define USB_TXCSRL10_STALL      0x00000010  // Send Stall.
#define USB_TXCSRL10_FLUSH      0x00000008  // Flush FIFO.
#define USB_TXCSRL10_UNDRN      0x00000004  // Underrun.
#define USB_TXCSRL10_ERROR      0x00000004  // Error.
#define USB_TXCSRL10_FIFONE     0x00000002  // FIFO Not Empty.
#define USB_TXCSRL10_TXRDY      0x00000001  // Transmit Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXCSRH10 register.
//
//*****************************************************************************
#define USB_TXCSRH10_AUTOSET    0x00000080  // Auto Set.
#define USB_TXCSRH10_ISO        0x00000040  // ISO.
#define USB_TXCSRH10_MODE       0x00000020  // Mode.
#define USB_TXCSRH10_DMAEN      0x00000010  // DMA Request Enable.
#define USB_TXCSRH10_FDT        0x00000008  // Force Data Toggle.
#define USB_TXCSRH10_DMAMOD     0x00000004  // DMA Request Mode.
#define USB_TXCSRH10_DTWE       0x00000002  // Data Toggle Write Enable.
#define USB_TXCSRH10_DT         0x00000001  // Data Toggle.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXMAXP10 register.
//
//*****************************************************************************
#define USB_RXMAXP10_MAXLOAD_M  0x000007FF  // Maximum Payload.
#define USB_RXMAXP10_MAXLOAD_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRL10 register.
//
//*****************************************************************************
#define USB_RXCSRL10_CLRDT      0x00000080  // Clear Data Toggle.
#define USB_RXCSRL10_STALLED    0x00000040  // Endpoint Stalled.
#define USB_RXCSRL10_STALL      0x00000020  // Send Stall.
#define USB_RXCSRL10_REQPKT     0x00000020  // Request Packet.
#define USB_RXCSRL10_FLUSH      0x00000010  // Flush FIFO.
#define USB_RXCSRL10_NAKTO      0x00000008  // NAK Timeout.
#define USB_RXCSRL10_DATAERR    0x00000008  // Data Error.
#define USB_RXCSRL10_OVER       0x00000004  // Overrun.
#define USB_RXCSRL10_ERROR      0x00000004  // Error.
#define USB_RXCSRL10_FULL       0x00000002  // FIFO Full.
#define USB_RXCSRL10_RXRDY      0x00000001  // Receive Packet Ready.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCSRH10 register.
//
//*****************************************************************************
#define USB_RXCSRH10_AUTOCL     0x00000080  // Auto Clear.
#define USB_RXCSRH10_AUTORQ     0x00000040  // Auto Request.
#define USB_RXCSRH10_ISO        0x00000040  // ISO.
#define USB_RXCSRH10_DMAEN      0x00000020  // DMA Request Enable.
#define USB_RXCSRH10_PIDERR     0x00000010  // PID Error.
#define USB_RXCSRH10_DISNYET    0x00000010  // Disable NYET
#define USB_RXCSRH10_DMAMOD     0x00000008  // DMA Request Mode.
#define USB_RXCSRH10_DTWE       0x00000004  // Data Toggle Write Enable.
#define USB_RXCSRH10_DT         0x00000002  // Data Toggle.
#define USB_RXCSRH10_INCRX      0x00000001  // Incomplete Receive.

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXCOUNT10
// register.
//
//*****************************************************************************
#define USB_RXCOUNT10_COUNT_M   0x00001FFF  // Receive Packet Count.
#define USB_RXCOUNT10_COUNT_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXTYPE10 register.
//
//*****************************************************************************
#define USB_TXTYPE10_SPEED_M    0x000000C0  // Operating Speed.
#define USB_TXTYPE10_SPEED_DFLT 0x00000000  // Default
#define USB_TXTYPE10_SPEED_FULL 0x00000080  // Full
#define USB_TXTYPE10_SPEED_LOW  0x000000C0  // Low
#define USB_TXTYPE10_PROTO_M    0x00000030  // Protocol.
#define USB_TXTYPE10_PROTO_CTRL 0x00000000  // Control
#define USB_TXTYPE10_PROTO_ISOC 0x00000010  // Isochronous
#define USB_TXTYPE10_PROTO_BULK 0x00000020  // Bulk
#define USB_TXTYPE10_PROTO_INT  0x00000030  // Interrupt
#define USB_TXTYPE10_TEP_M      0x0000000F  // Target Endpoint Number.
#define USB_TXTYPE10_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_TXINTERVAL10
// register.
//
//*****************************************************************************
#define USB_TXINTERVAL10_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_TXINTERVAL10_TXPOLL_M \
                                0x000000FF  // TX Polling
#define USB_TXINTERVAL10_TXPOLL_S \
                                0
#define USB_TXINTERVAL10_NAKLMT_S \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXTYPE10 register.
//
//*****************************************************************************
#define USB_RXTYPE10_SPEED_M    0x000000C0  // Operating Speed.
#define USB_RXTYPE10_SPEED_DFLT 0x00000000  // Default
#define USB_RXTYPE10_SPEED_FULL 0x00000080  // Full
#define USB_RXTYPE10_SPEED_LOW  0x000000C0  // Low
#define USB_RXTYPE10_PROTO_M    0x00000030  // Protocol.
#define USB_RXTYPE10_PROTO_CTRL 0x00000000  // Control
#define USB_RXTYPE10_PROTO_ISOC 0x00000010  // Isochronous
#define USB_RXTYPE10_PROTO_BULK 0x00000020  // Bulk
#define USB_RXTYPE10_PROTO_INT  0x00000030  // Interrupt
#define USB_RXTYPE10_TEP_M      0x0000000F  // Target Endpoint Number.
#define USB_RXTYPE10_TEP_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the USB_O_RXINTERVAL10
// register.
//
//*****************************************************************************
#define USB_RXINTERVAL10_NAKLMT_M \
                                0x000000FF  // NAK Limit.
#define USB_RXINTERVAL10_TXPOLL_M \
                                0x000000FF  // RX Polling
#define USB_RXINTERVAL10_TXPOLL_S \
                                0
#define USB_RXINTERVAL10_NAKLMT_S \
                                0

